test_cases/3d_water/3d_flashingHotWaterNozzle/1_hotWater_rampOut_lowRes_laminar/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=64;scalar=64";
    class       polyBoundaryMesh;
    location    "2e-08/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        nFaces          88;
        startFace       3505607;
    }
    outlet
    {
        type            patch;
        nFaces          18000;
        startFace       3505695;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          49186;
        startFace       3523695;
    }
)

// ************************************************************************* //
