test_cases/3d_water/3d_flashingHotWaterNozzle/1_hotWater_rampOut_lowRes_laminar/constant/thermophysicalProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          thermodynamicProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


// HRM coefficients (generally don't edit)

// varname			  kg m  s  -  -  -  -  value
theta_0      	theta_0      	[ 0  0  1  0  0  0  0] 3.84E-7;   // 6.51E-4 for "low pressure"
alphaFracExp    alphaFracExp	[ 0  0  0  0  0  0  0] -0.54;	  // -0.257  for "low pressure"
pNonDimExp      pNonDimExp 	[ 0  0  0  0  0  0  0] -1.76;	  // -2.24.  for "low pressure"

// working fluid sound speeds (don't trust fluid.dat values!)
aL              aL   		[ 0  1 -1  0  0  0  0] 1200.0;
aV              aV   		[ 0  1 -1  0  0  0  0] 300.0;

// bounding values for numerical stability
pMin            pMin 		[ 1 -1 -2  0  0  0  0]  100;
theta_floor     theta_floor 	[0   0  1  0  0  0  0] 1.0E-6;
rhoMin          rhoMin 		[ 1 -3  0  0  0  0  0] 0.01;

// non-condensible gas (ie ambient or nucleated gas) properties
rhoNCgas        rhoNCgas 	[ 1 -3  0  0  0  0  0] 1.2;
Rgas            rhoNCgas 	[ 0 2 -2 -1 0  0  0  ] 287;
cpGas           cpGas 		[ 0 2 -2 -1 0  0  0  ] 1005;

// used to calculate NCgas temperature, defined as hDatum = h_working_fluid - Cp*TGas
// here h_working_fluid = 0.110000E+07, for Tgas = 297K solve to find:
hDatum          hDatum 		[ 0 2 -2  0 0  0  0  ]  801515;

// HRMFoam switches to turn features on and off.
compressible yes;

pcritical   yes;
adiabatic   yes;
thermModel   refprop;
lBoundRho    yes;
tracerON      no;

tracerNames
(
);

// ************************************************************************* //
